# Rebar Free Form Accessor Can Be Hook Normal Method

Source: https://www.revitapidocs.com/2026/3848f3d8-f2f3-fca8-66af-9122d00b3869.htm

---

| Rebar Free Form Accessor Can Be Hook Normal Method |
| --- |

**Note: This API is now obsolete.**

A vector can be termination's (e.g. hook, crank) normal if for a bar specified by index, the bar direction is not parallel with the vector.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarFreeFormAccessor.CanBeTerminationPlaneNormal instead.")]
public bool CanBeHookNormal(
	int barIndex,
	int end,
	XYZ normal
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarFreeFormAccessor.CanBeTerminationPlaneNormal instead.")>
Public Function CanBeHookNormal (
	barIndex As Integer,
	end As Integer,
	normal As XYZ
) As Boolean
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarFreeFormAccessor.CanBeTerminationPlaneNormal instead.")]
bool CanBeHookNormal(
	int barIndex,
	int end,
	XYZ^ normal
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarFreeFormAccessor.CanBeTerminationPlaneNormal instead.")>]
member CanBeHookNormal :
        barIndex : int *
        end : int *
        normal : XYZ -> bool
```

#### Parameters

barIndex Int32
:   The index of bar for which it will try to see if termination's plane normal is applicable.

end Int32
:   The end of bar. Should be 0 for start, 1 for end.

normal XYZ
:   The teriantion's (e.g. hook, crank) plane normal that will be tested.

#### Return Value

Boolean
A vector can be termination's (e.g. hook, crank) normal if for a bar specified by index, the bar direction is not parallel with the vector. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | barIndex is not in the range \[ 0, NumberOfBarPositions\-1 ].  \-or\-  Invalid end. |

See Also

#### Reference

RebarFreeFormAccessor Class Autodesk.Revit.DB.Structure Namespace